{
  "highlightedProjectsComponent": {
    "title": "Highlighted Projects",
    "seeLiveProject": "See the live website",
    "highlightedProjects": [
      {
        "project": "Online Resume",
        "url": "https://murilo-marcal.vercel.app/",
        "description": "This is a personal project where I developed my online resume, learning and implementing Next.js. The goal of this project was to create a fully functional, aesthetically pleasing, and highly optimized online resume that showcases my technical skills and personal achievements. I wanted to build a site that not only looks great but also performs exceptionally well across various devices and screen sizes.<br/><br/> Throughout this project, I focused on creating a seamless user experience by implementing best practices in responsive design, accessibility, and performance optimization. I utilized Next.js for its powerful static and dynamic rendering capabilities, which allowed me to deliver content efficiently and enhance the site's performance. TailwindCSS was used for styling due to its flexibility and ease of use, enabling me to maintain a clean and consistent design. Additionally, I incorporated SEO strategies to improve the site's visibility on search engines, ensuring that my resume reaches a wider audience.<br/><br/> This project reflects my ability to handle the entire web development process, from concept and design to implementation and optimization, and demonstrates my commitment to creating high-quality web applications.",
        "image": "/online-resume.png",
        "technologiesUsed": [
          "NextJs",
          "TailwindCSS"
        ],
        "myContributions": [
          "Developed the locales and static rendering.",
          "Used TailwindCSS for styling and Next.js for rendering."
        ],
        "elementsToObserve": [
          "Static and dynamic rendering.",
          "Responsive and optimized design."
        ],
        "impactAndResults": [
          "A personal project demonstrating my skills in Next.js and TailwindCSS."
        ]
      },
      {
        "project": "Yogomarcas (in development)",
        "url": "https://yogomarcas.onrender.com",
        "image": "/yogomarcas.png",
        "description": "Developing a comprehensive website with a blog for a client, focusing on SEO optimization and client acquisition. This project aims to significantly enhance the client's online presence and attract potential customers through strategically structured content and effective conversion funnels. The primary objective is to create a robust digital platform that not only showcases the client's products and services but also engages visitors and converts them into loyal customers. The website is being developed with a keen focus on SEO best practices, including keyword optimization, meta tags, and high-quality content to ensure high search engine rankings and increased organic traffic.<br/><br/> TailwindCSS is used to design a visually appealing and user-friendly interface, ensuring a seamless and enjoyable user experience across all devices. Additionally, I am developing conversion funnels to guide visitors through the website, encouraging them to take specific actions such as signing up for newsletters, filling out contact forms, or making purchases. These funnels are strategically placed and designed to maximize the client's ROI by turning visitors into leads or customers.<br/><br/> This project also involves creating detailed analytics and reporting systems to track user behavior and website performance, providing valuable insights for continuous improvement. Although still in development, the project already demonstrates excellent SEO and design practices, showing great potential for significant improvements in client acquisition and online visibility once completed.<br/><br/> This project exemplifies my ability to work on complex web development tasks, focusing on both the technical and strategic aspects to deliver a comprehensive and effective online solution for the client.",
        "technologiesUsed": [
          "TailwindCSS",
          "RubyOnRails",
          "Hotwired",
          "Ruby",
          "HTML"
        ],
        "myContributions": [
          "Structured imperative designs with effective CTAs and SEO for optimized keywords.",
          "Developed conversion funnels to optimize client acquisition."
        ],
        "elementsToObserve": [
          "SEO structure and conversion funnels.",
          "Responsive design focused on CTAs."
        ],
        "impactAndResults": [
          "The project is in development but already demonstrates good SEO and design practices."
        ]
      }
    ]
  }
}
